;;     ____            _    __                               _                 
;;    /  _/  ____     (_)  / /_            _____   ____     (_)  ____     ____ 
;;    / /   / __ \   / /  / __/  ______   / ___/  / __ \   / /  / __ \   / __ \
;;  _/ /   / / / /  / /  / /_   /_____/  (__  )  / / / /  / /  / /_/ /  / /_/ /
;; /___/  /_/ /_/  /_/   \__/           /____/  /_/ /_/  /_/  / .___/  / .___/ 
;;                                                           /_/      /_/      
;;            __                   __
;;   ___     / /_         ___     / /
;;  / _ \   / __/        / _ \   / / 
;; /  __/  / /_    _    /  __/  / /  
;; \___/   \__/   (_)   \___/  /_/   
;;
;; 代码块补全
(require 'yasnippet)
(yas-reload-all)
(add-hook 'prog-mode-hook #'yas-minor-mode)

;; 代码块补全快捷键
(global-set-key (kbd "H-w") #'aya-create)
(global-set-key (kbd "H-y") #'aya-expand)

(provide 'init-snippet)
